In [1]:
import sqlite3 as lite
con = lite.connect('test.sqlite')
cur = con.cursor()

cur.execute('SELECT SQlITE_VERSION()')
data = cur.fetchone()

con.close()

In [2]:
data

('3.21.0',)

In [3]:
import sqlite3 as lite

with lite.connect('test.sqlite') as con:
    cur = con.cursor()

    cur.execute('SELECT SQlITE_VERSION()')
    data = cur.fetchone()

In [5]:
data

('3.21.0',)

In [6]:
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("DROP TABLE IF EXISTS PhoneAddress")
    
    cur.execute("""
        CREATE TABLE PhoneAddress(
            phone   CHAR(10) PRIMARY KEY, 
            address TEXT, 
            name    TEXT unique,
            age     INT NOT NULL
        )""")
    
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)")
    cur.execute("SELECT phone,address FROM PhoneAddress")
    
    data = cur.fetchall()

In [7]:
data

[('0912173381', 'United State'),
 ('0928375018', 'Tokyo Japan'),
 ('0957209108', 'Taipei')]

In [8]:
for rec in data:
    print(rec[0], rec[1])

0912173381 United State
0928375018 Tokyo Japan
0957209108 Taipei

In [9]:
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("SELECT phone,address FROM PhoneAddress")  
    data1 = cur.fetchone()
    data2 = cur.fetchall()

In [10]:
data1

('0912173381', 'United State')

In [11]:
data2

[('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

In [12]:
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("SELECT * FROM PhoneAddress")  
    data = cur.fetchall()

In [13]:
data

[('0912173381', 'United State', 'Jhon Doe', 53),
 ('0928375018', 'Tokyo Japan', 'MuMu Cat', 6),
 ('0957209108', 'Taipei', 'Richard', 29)]

In [14]:
import pandas
employee = [
    {'name':'Mary', 'age':23 , 'gender': 'F'},
    {'name':'John', 'age':33 , 'gender': 'M'}]

df = pandas.DataFrame(employee)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
age       2 non-null int64
gender    2 non-null object
name      2 non-null object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [17]:
with lite.connect('test.sqlite') as con:
    df.to_sql('employee', con = con)

In [18]:
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("SELECT * FROM employee")  
    data = cur.fetchall()
    print(data)

[(0, 23, 'F', 'Mary'), (1, 33, 'M', 'John')]

In [20]:
with lite.connect('test.sqlite') as con:
    df2 = pandas.read_sql_query('SELECT * FROM employee', con = con)

In [21]:
df2

   index  age gender  name
0      0   23      F  Mary
1      1   33      M  John

In [22]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample2.csv', index_col=0)

In [24]:
df['price'] = df['price'].map(lambda e : int(e.replace('元/月','').replace(',','')))

In [28]:
df['search_date']  = pandas.to_datetime(df['search_date'], format = '%Y-%m-%d')

In [30]:
df['btype'] = df['building_use'].map(lambda e: str(e).split('/')[0])
df['buse'] = df['building_use'].map(lambda e: str(e).split('/')[1] if len(str(e).split('/'))> 1 else None)

In [32]:
with lite.connect('test.sqlite') as con:
    df.to_sql('rent_591', con = con, index = None)

In [44]:
with lite.connect('test.sqlite') as con:
    #df2 = pandas.read_sql_query('SELECT * FROM rent_591', con = con)
    #df2 = pandas.read_sql_query('SELECT * FROM rent_591 WHERE price > 10000', con = con)
    #df2 = pandas.read_sql_query('SELECT title, building_area, price FROM rent_591', con = con)
    #df2 = pandas.read_sql_query('SELECT title, building_area, price FROM rent_591 ORDER BY price DESC', con = con)
    #df2 = pandas.read_sql_query('SELECT avg(price/building_area) FROM rent_591', con = con)
    #df2 = pandas.read_sql_query('SELECT buse, btype, avg(price/building_area) FROM rent_591 group by buse, btype', con = con)
    #df2 = pandas.read_sql_query('SELECT title, building_area, price FROM rent_591 ORDER BY price DESC LIMIT 3', con = con)
    #df2 = pandas.read_sql_query('SELECT btype, avg(price) FROM rent_591 group by btype', con = con)
    df2 = pandas.read_sql_query('SELECT btype, avg(price) FROM rent_591 group by btype HAVING avg(price) > 10000', con = con)
df2

  btype     avg(price)
0   nan   84789.830692
1    倉庫   25248.425926
2    公寓   16350.106894
3    別墅   25951.827907
4    廠房   76662.857143
5    廠辦  100681.818182
6   透天厝   17622.803203
7  電梯大樓   47822.119324

## MySQL 
- https://dev.mysql.com/get/Downloads/MySQLInstaller/mysql-installer-community-8.0.12.0.msi
- https://www.microsoft.com/en-us/download/confirmation.aspx?id=42642

In [45]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='test',
                              host='127.0.0.1',
                              database='house')
cnx.close()

In [49]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='test',
                              host='127.0.0.1',
                              database='house')
cursor = cnx.cursor()

query = ("""
        CREATE TABLE PhoneAddress(
            phone   CHAR(10) PRIMARY KEY, 
            address VARCHAR(1024), 
            name    VARCHAR(1024),
            age     INT NOT NULL
        )""")

cursor.execute(query)
cursor.close()
cnx.close()

In [51]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='test',
                              host='127.0.0.1',
                              database='house')
cursor = cnx.cursor()


cursor.execute(("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)"))
cursor.execute(("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)"))
cursor.execute(("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)"))
cnx.commit()
cursor.close()
cnx.close()

In [52]:
import mysql.connector

cnx = mysql.connector.connect(user='root', password='test',
                              host='127.0.0.1',
                              database='house')
cursor = cnx.cursor()


cursor.execute(("SELECT * FROM PhoneAddress"))
for rec in cursor:
    print(rec)
cursor.close()
cnx.close()

('0912173381', 'United State', 'Jhon Doe', 53)
('0928375018', 'Tokyo Japan', 'MuMu Cat', 6)
('0957209108', 'Taipei', 'Richard', 29)

## SQL ALchemy
- https://docs.sqlalchemy.org/en/latest/core/engines.html

#### default
- engine = create_engine('mysql://scott:tiger@localhost/foo')

#### mysql-python
- engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

#### MySQL-connector-python
- engine = create_engine('mysql+mysqlconnector://scott:tiger@localhost/foo')

#### OurSQL
- engine = create_engine('mysql+oursql://scott:tiger@localhost/foo')

In [64]:
from sqlalchemy import create_engine
engine = create_engine("mysql+mysqlconnector://root:test@localhost/house")
df.head(1000).to_sql('rent_591', engine,if_exists='replace', chunksize=100)